USE Hospital_1

INSERT INTO Departaments 
VALUES 
	('Терапевтическое отделение'),
	('Хирургическое отделение'),
	('Травматологическое отделение'),
	('ЛОР отделение')

INSERT INTO Diagnoses 
VALUES 
	('ОРЗ'),
	('Грипп'),
	('Бронхит'),
	('Пневмония'),
	('Аппендицит'),
	('Панкреатит'),
	('Закрытый перелом'),
	('Надрыв связок'),
	('Отит'),
	('Глухота')

INSERT INTO Doctors 
VALUES 
	('Василий', 'Иванов', 4),
	('Адам', 'Козлевич', 1),
	('Эраст', 'Фандорин', 2),
	('Соня', 'Мармеладова', 3),
	('Элла', 'Щукина', 1),
	('Альфред', 'Кох', 3),
	('Панфил', 'Харликов', 2),
	('Татьяна', 'Филова', 1),
	('Иван', 'Сусанин', 4)

INSERT INTO Patients 
VALUES 
	('Мэри', 'Морстен'),
	('Тобиас', 'Грегсон'),
	('Этелни', 'Джонс'),
	('Стенли', 'Хопкинс'),
	('Себастьян', 'Моран'),
	('Фред', 'Уизли'),
	('Лаванда', 'Браун'),
	('Иполлит', 'Курагин'),
	('Федор', 'Долохов'),
	('Платон', 'Каратаев'),
	('Марья', 'Курагина')

INSERT INTO ReceptionDuration 
VALUES 
	(10),
	(20),
	(30)

INSERT INTO Reception 
VALUES 
	(1, 2, '2020-01-31 07:15:00', 30, 2),
	(5, 2, '2020-01-31 08:10:00', 20, 1),
	(6, 2, '2020-01-31 09:00:00', 30, 2),
	(3, 5, '2020-01-31 09:00:00', 30, 1),
	(4, 5, '2020-01-31 09:40:00', 20, 1),
	(2, 3, '2020-01-31 08:00:00', 30, 5),
	(1, 7, '2020-01-31 08:00:00', 30, 6),
	(7, 3, '2020-01-31 09:00:00', 20, 5),
	(8, 4, '2020-01-31 09:40:00', 30, 7),
	(9, 6, '2020-01-31 09:40:00', 20, 8),
	(9, 1, '2020-01-31 12:40:00', 30, 10),
	(10, 6, '2020-01-31 17:40:00', 20, 8),
	(11, 5, '2020-02-01 07:40:00', 20, 1),
	(3, 4, '2020-02-01 14:40:00', 10, 7),
	(4, 6, '2020-02-01 14:40:00', 20, 7),
	(5, 1, '2020-02-01 14:30:00',20, 9),
	(1, 8, '2020-02-01 16:40:00', 30, 4),
	(2, 5, '2020-02-01 17:40:00', 30, 2),
	(4, 4, '2020-02-01 18:40:00', 10, 8),
	(1, 1, '2020-02-01 08:10:00', 20, 9)
	


